Revit 2024 API
Application.NewXYZ Method
Creates a XYZ object at the origin.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public XYZ NewXYZ()
Visual Basic
Public Function NewXYZ As XYZ
Visual C++
public:
XYZ^ NewXYZ()
See Also
Application Class
NewXYZ Overload
Autodesk.Revit.Creation Namespace